<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.asdf</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>asdf</string>
		<key>SIGNINGCERTIFICATE</key>
		<string>Developer ID Installer: ()</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Development</string>
			<key>description</key>
			<string>asdf is a CLI tool that can manage multiple language runtime versions on a per-project basis. It is like gvm, nvm, rbenv &amp; pyenv (and more) all in one! Simply install your language's plugin!</string>
			<key>developer</key>
			<string>Akash Manohar</string>
			<key>display_name</key>
			<string>asdf</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.catawiki.munki.asdf</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.grahampugh.recipes.commonprocessors/StringReplacer</key>
			<dict>
				<key>git_hash</key>
				<string>a2d4f7bc18c2b403812b10846a45cfc3717a0448</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/CommonProcessors/StringReplacer.py</string>
				<key>sha256_hash</key>
				<string>a57ca13c0bbf5c4f0631b44e4b29c410d1d3a9aba253b2fe38b9be7e5895a0fc</string>
			</dict>
			<key>com.github.rtrouton.SharedProcessors/PkgSigner</key>
			<dict>
				<key>git_hash</key>
				<string>56fc1ee3588f12cdd86e4e202821229873c27e21</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py</string>
				<key>sha256_hash</key>
				<string>464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.catawiki.download.asdf</key>
			<dict>
				<key>git_hash</key>
				<string>9c84bed14955011043701f333cd2f1d983c5334b</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/asdf/asdf.download.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>b4399f9517bdac1a0af41eebd933aaaeee5e4d9a5a6d7ec0327abbdc93f04850</string>
			</dict>
			<key>com.github.catawiki.munki.asdf</key>
			<dict>
				<key>git_hash</key>
				<string>9c84bed14955011043701f333cd2f1d983c5334b</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/asdf/asdf.munki.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>268aede51ffb641177b7c9ac2058d46d7c163cf9a0b92253e3480da7b44d642c</string>
			</dict>
			<key>com.github.catawiki.pkg.asdf</key>
			<dict>
				<key>git_hash</key>
				<string>9c84bed14955011043701f333cd2f1d983c5334b</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/asdf/asdf.pkg.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>ca552feef79b317836bca5d82022227915521f0da4f86074b4484cecd23fe542</string>
			</dict>
			<key>com.github.catawiki.sign.asdf</key>
			<dict>
				<key>git_hash</key>
				<string>9c84bed14955011043701f333cd2f1d983c5334b</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/asdf/asdf.sign.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>750ab9ddd625f897fbee8706807a9e2dc2a48848a387003d6febef68818f8eee</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
