Identifier: local.munki.autoconf
Input:
  MUNKI_REPO_SUBDIR: apps/gnu
  NAME: autoconf
  pkginfo:
    catalogs:
    - testing
    category: Development
    description: Automatic configure script builder.
    developer: GNU Software
    display_name: '%NAME%'
    name: '%NAME%'
    requires:
    - m4
    unattended_install: true
ParentRecipe: com.github.humanendpoint.munki.autoconf
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.humanendpoint.processors/BuildMaker:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/processors/BuildMaker.py
      sha256_hash: f73b95fa7ce7b0c9bc007ce0670bc33b7acfb1501d2545f6435d9f3dede61c3c
    com.github.humanendpoint.processors/URLDownloaderPython:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/processors/URLDownloaderPython.py
      sha256_hash: 72337e153221fe1ba908684482f220ad376e59ad3b3a8f37b4bd0b7268998296
    com.github.rtrouton.SharedProcessors/PkgSigner:
      git_hash: 56fc1ee3588f12cdd86e4e202821229873c27e21
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py
      sha256_hash: 464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56
  parent_recipes:
    com.github.humanendpoint.download.autoconf:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/autoconf/autoconf.download.recipe.yaml
      sha256_hash: aeb3314715b54284fb3e1bc140d052978f57105fb30812ef614029541430d126
    com.github.humanendpoint.munki.autoconf:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/autoconf/autoconf.munki.recipe.yaml
      sha256_hash: 48d8f37d4404d1f7da756daacccc55d88c1ee01d59e13c32741cc988d05324a6
    com.github.humanendpoint.pkg.autoconf:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/autoconf/autoconf.pkg.recipe.yaml
      sha256_hash: 2a0179c103a7cb6fd462bc73ca59f56ab19bedb92f06c9fb9ed004ea8071ee35
    com.github.humanendpoint.sign.autoconf:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/autoconf/autoconf.sign.recipe.yaml
      sha256_hash: a19fef4cb42c60cc06f95cb78f90772d497dbdd6ce4d0bb6f99c908a760b108f
