<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.docker-buildx</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Docker</string>
		<key>NAME</key>
		<string>docker-buildx</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Development</string>
			<key>description</key>
			<string>Docker CLI plugin for extended build capabilities with BuildKit. Used together with Docker-Cli. Will place the binary in ~/.docker/cli-plugins.</string>
			<key>developer</key>
			<string>Docker</string>
			<key>display_name</key>
			<string>Docker-Buildx</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
loggedInUser=$(stat -f%Su /dev/console)
dockerDir="/Users/$loggedInUser/.docker"
cliPluginsDir="$dockerDir/cli-plugins"

if [ ! -d "$dockerDir" ]; then
	mkdir -p "$dockerDir"
fi

if [ ! -d "$cliPluginsDir" ]; then
	mkdir "$cliPluginsDir"
fi

mv /usr/local/bin/buildx-v*.darwin-arm64 $cliPluginsDir
chown $loggedInUser:staff $cliPluginsDir/buildx-v*.darwin-arm64
</string>
			<key>requires</key>
			<array>
				<string>Docker</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.humanendpoint.munki.docker-buildx</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.rtrouton.SharedProcessors/PkgSigner</key>
			<dict>
				<key>git_hash</key>
				<string>56fc1ee3588f12cdd86e4e202821229873c27e21</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py</string>
				<key>sha256_hash</key>
				<string>464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.humanendpoint.download.docker-buildx</key>
			<dict>
				<key>git_hash</key>
				<string>c539dfe37f1f07bb737f35391d63a5bca3046319</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/Docker/Docker-Buildx.download.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>7aa880618cd30d01c87ef683863ccf046594e496ebf8ce44cb0d9d57fe824c96</string>
			</dict>
			<key>com.github.humanendpoint.munki.docker-buildx</key>
			<dict>
				<key>git_hash</key>
				<string>c539dfe37f1f07bb737f35391d63a5bca3046319</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/Docker/Docker-Buildx.munki.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>92cc9facd9e23871bc4e78df22b9d67fc90815d587d69c25e8a113a04d0c97a8</string>
			</dict>
			<key>com.github.humanendpoint.pkg.docker-buildx</key>
			<dict>
				<key>git_hash</key>
				<string>c539dfe37f1f07bb737f35391d63a5bca3046319</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/Docker/Docker-Buildx.pkg.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>30d8d138a424cc96ff4a0b2f2ffa94382825f913f1f41609e51f705b09c6f2e3</string>
			</dict>
			<key>com.github.humanendpoint.sign.docker-buildx</key>
			<dict>
				<key>git_hash</key>
				<string>c539dfe37f1f07bb737f35391d63a5bca3046319</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/Docker/Docker-Buildx.sign.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>2d08d883faae845169fb2b017090377c5539badf49f974bfbb6d36d7dcb41c8d</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
