<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.gawk</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/gnu</string>
		<key>NAME</key>
		<string>gawk</string>
		<key>SIGNINGCERTIFICATE</key>
		<string>Developer ID Installer: ()</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Development</string>
			<key>description</key>
			<string>GNU awk utility.</string>
			<key>developer</key>
			<string>GNU Software</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>mpfr</string>
				<string>readline</string>
				<string>gettext</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.humanendpoint.munki.gawk</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.humanendpoint.processors/BuildMaker</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/processors/BuildMaker.py</string>
				<key>sha256_hash</key>
				<string>f73b95fa7ce7b0c9bc007ce0670bc33b7acfb1501d2545f6435d9f3dede61c3c</string>
			</dict>
			<key>com.github.rtrouton.SharedProcessors/PkgSigner</key>
			<dict>
				<key>git_hash</key>
				<string>56fc1ee3588f12cdd86e4e202821229873c27e21</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py</string>
				<key>sha256_hash</key>
				<string>464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.humanendpoint.download.gawk</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/gawk/gawk.download.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>fcab7a205975e9708149920b5e54a76b462c0a2554287f994799ec7493e0e585</string>
			</dict>
			<key>com.github.humanendpoint.munki.gawk</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/gawk/gawk.munki.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>c2c0f398366da0dd0485680aa66389282944b427313c4fa8c3bd49cb31898b5d</string>
			</dict>
			<key>com.github.humanendpoint.pkg.gawk</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/gawk/gawk.pkg.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>22ed924d24e1e584b880418b0f9947b38cb7e38018c5327c34d71f0bfdf5aca9</string>
			</dict>
			<key>com.github.humanendpoint.sign.gawk</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/gawk/gawk.sign.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>cc1293422ecdb0566e756a33a61e4ca03eb750fb7eb683327c4e357df8b3c021</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
