<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.gettext</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Homebrew</string>
		<key>NAME</key>
		<string>gettext</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Development</string>
			<key>description</key>
			<string>GNU internationalization (i18n) and localization (l10n) library.</string>
			<key>developer</key>
			<string>GNU Software</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>libxml2</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.humanendpoint.munki.gettext</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.humanendpoint.processors/BuildMaker</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/processors/BuildMaker.py</string>
				<key>sha256_hash</key>
				<string>f73b95fa7ce7b0c9bc007ce0670bc33b7acfb1501d2545f6435d9f3dede61c3c</string>
			</dict>
			<key>com.github.rtrouton.SharedProcessors/PkgSigner</key>
			<dict>
				<key>git_hash</key>
				<string>56fc1ee3588f12cdd86e4e202821229873c27e21</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py</string>
				<key>sha256_hash</key>
				<string>464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.humanendpoint.download.gettext</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/gettext/gettext.download.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>dcb9626d6f44ae95c03b541e3f8df559b6a723cd85ad2044831d0c32faf324fe</string>
			</dict>
			<key>com.github.humanendpoint.munki.gettext</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/gettext/gettext.munki.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>59480339c9f1857bb0d848e8405bc531076d862d33be5ce58c19b454f0838baa</string>
			</dict>
			<key>com.github.humanendpoint.pkg.gettext</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/gettext/gettext.pkg.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>45d54ac83516d0713e9c860d25a3fb0fd78a0941ce6c17050b5e560c047beb9f</string>
			</dict>
			<key>com.github.humanendpoint.sign.gettext</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/gettext/gettext.sign.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>12c9e64ef4fc11f61e47c99e97f45c745b6562befc63e7a763ee8b121a79303f</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
