<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.gnupg</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>GnuPG</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Development</string>
			<key>description</key>
			<string>GnuPG is a complete and free implementation of the OpenPGP standard as defined by RFC4880 (also known as PGP). GnuPG allows you to encrypt and sign your data and communications; it features a versatile key management system, along with access modules for all kinds of public key directories.</string>
			<key>developer</key>
			<string>GnuPG</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>postinstall_script</key>
			<string>#!/bin/bash
touch /Library/CPE/Logs/.gnupg</string>
			<key>requires</key>
			<array>
				<string>Rosetta2</string>
			</array>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.humanendpoint.munki.gnupg</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.homebysix.VersionSplitter/VersionSplitter</key>
			<dict>
				<key>git_hash</key>
				<string>dc086969ec741e70edcf24774d50fba627732496</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/VersionSplitter/VersionSplitter.py</string>
				<key>sha256_hash</key>
				<string>121f98262a70e62f58e81f16de00f69785b5aed765ed43961319759757e2d55c</string>
			</dict>
			<key>com.github.jessepeterson.munki.GrandPerspective/SourceForgeURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>0cfdb8512b28c778caaef313338596038a66184c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.jessepeterson-recipes/GrandPerspective/SourceForgeURLProvider.py</string>
				<key>sha256_hash</key>
				<string>a18b2d712f87149a15cc92567f25e5f7038e9d2da4e9e30c42e32dfc8f59e2b0</string>
			</dict>
			<key>com.github.rtrouton.SharedProcessors/PkgSigner</key>
			<dict>
				<key>git_hash</key>
				<string>56fc1ee3588f12cdd86e4e202821229873c27e21</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py</string>
				<key>sha256_hash</key>
				<string>464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.humanendpoint.download.gnupg</key>
			<dict>
				<key>git_hash</key>
				<string>32a36cf6bb3098756dc4600c36e6f9441554f1c6</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/GnuPG/GnuPG.download.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>5d95e9e891cb09ee8482785758fc9709983e963ce54fcdd5ea562c4482d2b7bc</string>
			</dict>
			<key>com.github.humanendpoint.munki.gnupg</key>
			<dict>
				<key>git_hash</key>
				<string>32a36cf6bb3098756dc4600c36e6f9441554f1c6</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/GnuPG/GnuPG.munki.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>e2303213eacf35eb4c7d7c500c5fa3bee049cfc043aeb6175230cfc8aadad9a9</string>
			</dict>
			<key>com.github.humanendpoint.pkg.gnupg</key>
			<dict>
				<key>git_hash</key>
				<string>32a36cf6bb3098756dc4600c36e6f9441554f1c6</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/GnuPG/GnuPG.pkg.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>9010a9c8ec1e740439e6f3702b503f6f0d76d6a5973e5bba37cbeb4919e24afb</string>
			</dict>
			<key>com.github.humanendpoint.sign.gnupg</key>
			<dict>
				<key>git_hash</key>
				<string>32a36cf6bb3098756dc4600c36e6f9441554f1c6</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/GnuPG/GnuPG.sign.recipe</string>
				<key>sha256_hash</key>
				<string>c9827da65c5399b08f279e0c6caa6649b0b76531b3437c6ec23b6a41e6c679f7</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
