Identifier: local.munki.libksba
Input:
  MUNKI_REPO_SUBDIR: apps/gnu
  NAME: libksba
  pkginfo:
    catalogs:
    - testing
    category: Development
    description: X.509 and CMS library from GNU.
    developer: GNU Software
    display_name: '%NAME%'
    name: '%NAME%'
    requires:
    - libgpg-error
    unattended_install: true
ParentRecipe: com.github.humanendpoint.munki.libksba
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.humanendpoint.processors/BuildMaker:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/processors/BuildMaker.py
      sha256_hash: f73b95fa7ce7b0c9bc007ce0670bc33b7acfb1501d2545f6435d9f3dede61c3c
    com.github.humanendpoint.processors/URLDownloaderPython:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/processors/URLDownloaderPython.py
      sha256_hash: 72337e153221fe1ba908684482f220ad376e59ad3b3a8f37b4bd0b7268998296
    com.github.rtrouton.SharedProcessors/PkgSigner:
      git_hash: 56fc1ee3588f12cdd86e4e202821229873c27e21
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py
      sha256_hash: 464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56
  parent_recipes:
    com.github.humanendpoint.download.libksba:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/libksba/libksba.download.recipe.yaml
      sha256_hash: dc21d5ebb190980b2c21f96530daad9ecdb27e76db4ecee74d7190797ea00f28
    com.github.humanendpoint.munki.libksba:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/libksba/libksba.munki.recipe.yaml
      sha256_hash: 117e27221001145e2656b3172c3788d8e3f29418aef5561816c9e02db3c4d542
    com.github.humanendpoint.pkg.libksba:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/libksba/libksba.pkg.recipe.yaml
      sha256_hash: 2d34e46555b899beb736a02579403e1fd4b739c7bcef5090e295dbb4db198367
    com.github.humanendpoint.sign.libksba:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/libksba/libksba.sign.recipe.yaml
      sha256_hash: 681aa479d3bc6fe131ce63213b7dcbaaaaeccd01ed6966df5feca0ed672c541d
