<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.libxml2</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>libxml2</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Development</string>
			<key>description</key>
			<string>libxml2 is an XML toolkit implemented in C, originally developed for the GNOME Project.</string>
			<key>developer</key>
			<string>GNU</string>
			<key>display_name</key>
			<string>libxml2</string>
			<key>requires</key>
			<array>
				<string>readline</string>
				<string>icu4c</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.humanendpoint.munki.libxml2</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.humanendpoint.processors/BuildMaker</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/processors/BuildMaker.py</string>
				<key>sha256_hash</key>
				<string>f73b95fa7ce7b0c9bc007ce0670bc33b7acfb1501d2545f6435d9f3dede61c3c</string>
			</dict>
			<key>com.github.humanendpoint.processors/URLDownloaderPython</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/processors/URLDownloaderPython.py</string>
				<key>sha256_hash</key>
				<string>72337e153221fe1ba908684482f220ad376e59ad3b3a8f37b4bd0b7268998296</string>
			</dict>
			<key>com.github.humanendpoint.processors/URLVersionSearcher</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/processors/URLVersionSearcher.py</string>
				<key>sha256_hash</key>
				<string>281b907d444f7c839f701417bdeeed942641deba1b64238bc0ba4846891eaf65</string>
			</dict>
			<key>com.github.jgstew.SharedProcessors/URLTextSearcherArray</key>
			<dict>
				<key>git_hash</key>
				<string>56fbf36bff33c40c595b7bf26673d3eb6955d91d</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/URLTextSearcherArray.py</string>
				<key>sha256_hash</key>
				<string>21272395adc58e6b385d4e7fee54f211939726eab83ce9650f226559c89a471e</string>
			</dict>
			<key>com.github.jgstew.SharedProcessors/VersionMaximumArray</key>
			<dict>
				<key>git_hash</key>
				<string>af130f4f0f2b3ccb5762c1340bc5cac64006b10c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/VersionMaximumArray.py</string>
				<key>sha256_hash</key>
				<string>3f596031c0edd4d011ec20a1664e0434073106eeaf7dfa913f884bd881449d53</string>
			</dict>
			<key>com.github.rtrouton.SharedProcessors/PkgSigner</key>
			<dict>
				<key>git_hash</key>
				<string>56fc1ee3588f12cdd86e4e202821229873c27e21</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py</string>
				<key>sha256_hash</key>
				<string>464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.humanendpoint.download.libxml2</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/libxml2/libxml2.download.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>1b5a94929ae7a1ad63c03a9f457ab05ac59c08d76c54f2c867201a35b048fc20</string>
			</dict>
			<key>com.github.humanendpoint.munki.libxml2</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/libxml2/libxml2.munki.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>1364d04fc7f3c0efa298fcf3b85697a1afa662d85c96608bd08fe212b5534841</string>
			</dict>
			<key>com.github.humanendpoint.pkg.libxml2</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/libxml2/libxml2.pkg.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>94a53e037c43924f785991ddccc91159491968cc1538161b99b33c6dd0157897</string>
			</dict>
			<key>com.github.humanendpoint.sign.libxml2</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/libxml2/libxml2.sign.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>62c0a1dd45fc7aa547db462cbecbc7f1925f7da3cd7ebd95cec7f9dd7d64a53c</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
