Identifier: local.munki.libyaml
Input:
  MUNKI_REPO_SUBDIR: apps/libyaml
  NAME: libyaml
  pkginfo:
    catalogs:
    - testing
    category: Development
    description: A C library for parsing and emitting YAML.
    developer: The YAML Project
    display_name: '%NAME%'
    name: '%NAME%'
    requires:
    - coreutils
    unattended_install: true
ParentRecipe: com.github.humanendpoint.munki.libyaml
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.humanendpoint.processors/BuildMaker:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/processors/BuildMaker.py
      sha256_hash: f73b95fa7ce7b0c9bc007ce0670bc33b7acfb1501d2545f6435d9f3dede61c3c
    com.github.humanendpoint.processors/URLDownloaderPython:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/processors/URLDownloaderPython.py
      sha256_hash: 72337e153221fe1ba908684482f220ad376e59ad3b3a8f37b4bd0b7268998296
    com.github.rtrouton.SharedProcessors/PkgSigner:
      git_hash: 56fc1ee3588f12cdd86e4e202821229873c27e21
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py
      sha256_hash: 464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56
  parent_recipes:
    com.github.humanendpoint.download.libyaml:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/libyaml/libyaml.download.recipe.yaml
      sha256_hash: 177a31d22a09ea03b2a2341655f9696e142f4147e032b5297b599654cddc5665
    com.github.humanendpoint.munki.libyaml:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/libyaml/libyaml.munki.recipe.yaml
      sha256_hash: 03fe3563ce41d01380a023104dd64cbdd73ad0b071eb4fdd96cc875a75d79448
    com.github.humanendpoint.pkg.libyaml:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/libyaml/libyaml.pkg.recipe.yaml
      sha256_hash: f2dea048e2db1d953448d700499398ba8909fcbb35f0956b969430828fbf583b
    com.github.humanendpoint.sign.libyaml:
      git_hash: 5cb2b8a3ea42329fb93961fb541ebb221b174108
      path: ~/work/munki/munki/autopkg/recipes/libyaml/libyaml.sign.recipe.yaml
      sha256_hash: 35bb66aa4da19653740c2fdaab79d171f5ad728e71899394144f5d68a0718afc
