<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.readline</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Homebrew</string>
		<key>NAME</key>
		<string>readline</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Development</string>
			<key>description</key>
			<string>Library for command-line editing.</string>
			<key>developer</key>
			<string>GNU Software</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.humanendpoint.munki.readline</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.humanendpoint.processors/BuildMaker</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/processors/BuildMaker.py</string>
				<key>sha256_hash</key>
				<string>f73b95fa7ce7b0c9bc007ce0670bc33b7acfb1501d2545f6435d9f3dede61c3c</string>
			</dict>
			<key>com.github.humanendpoint.processors/TrimVersion</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/processors/TrimVersion.py</string>
				<key>sha256_hash</key>
				<string>777db3bc6c26d839aee6432cf582aa0050f04b933a4c446c09b579cc17ad709f</string>
			</dict>
			<key>com.github.rtrouton.SharedProcessors/PkgSigner</key>
			<dict>
				<key>git_hash</key>
				<string>56fc1ee3588f12cdd86e4e202821229873c27e21</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py</string>
				<key>sha256_hash</key>
				<string>464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.humanendpoint.download.readline</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/readline/readline.download.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>8f3cffc1e36459bbf93e477077ebcd1a107d6a42049157ccc4b755eca50b5cef</string>
			</dict>
			<key>com.github.humanendpoint.munki.readline</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/readline/readline.munki.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>698834d4047a140b458b41c275e7c073446dd8fe9cc167ba40fc563bdd344a8e</string>
			</dict>
			<key>com.github.humanendpoint.pkg.readline</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/readline/readline.pkg.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>e880ce86a46ff15f50d5aa1cf9adafdb6b13c4aa7f2e461deca959156b600215</string>
			</dict>
			<key>com.github.humanendpoint.sign.readline</key>
			<dict>
				<key>git_hash</key>
				<string>5cb2b8a3ea42329fb93961fb541ebb221b174108</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/readline/readline.sign.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>746749b37b0cb4ce4d4cca440d5f5487289b8e248e3b4e1a8b4c30c6365b2860</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
