Identifier: local.munki.Shellcheck
Input:
  INPUT_DESCRIPTION: Integrates ShellCheck into VS Code, a linter for Shell scripts.
  MARKETPLACE_NAME: shellcheck
  MUNKI_REPO_SUBDIR: apps/VSCE
  NAME: VSCE-Shellcheck
  PUBLISHER: timonwong
  pkginfo:
    catalogs:
    - testing
    category: VSCode Extensions
    description: ''
    developer: Timon Wong
    display_name: Shellcheck
    name: '%NAME%'
    unattended_install: true
ParentRecipe: com.github.humanendpoint.munki.vsceshellcheck
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.recipes.commonprocessors/StringReplacer:
      git_hash: a2d4f7bc18c2b403812b10846a45cfc3717a0448
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/CommonProcessors/StringReplacer.py
      sha256_hash: a57ca13c0bbf5c4f0631b44e4b29c410d1d3a9aba253b2fe38b9be7e5895a0fc
    com.github.rtrouton.SharedProcessors/PkgSigner:
      git_hash: 56fc1ee3588f12cdd86e4e202821229873c27e21
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py
      sha256_hash: 464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56
  parent_recipes:
    com.github.humanendpoint.download.vsceshellcheck:
      git_hash: fae7a9cd9ad6215a08a025fbc4b53e47c5b0cbfa
      path: ~/work/munki/munki/autopkg/recipes/VSCodeExtensions/Shellcheck.download.recipe.yaml
      sha256_hash: b086fb0b0885d085a25e9033a92cff90bd7f27d4ddfe9e6363e53f4ba309579f
    com.github.humanendpoint.munki.vsceshellcheck:
      git_hash: fae7a9cd9ad6215a08a025fbc4b53e47c5b0cbfa
      path: ~/work/munki/munki/autopkg/recipes/VSCodeExtensions/Shellcheck.munki.recipe.yaml
      sha256_hash: 19caa9203edffb2f7ae20923d66d309ad2d88264b6f8d429004bcfb4c352c7ea
    com.github.humanendpoint.pkg.vsceshellcheck:
      git_hash: fae7a9cd9ad6215a08a025fbc4b53e47c5b0cbfa
      path: ~/work/munki/munki/autopkg/recipes/VSCodeExtensions/Shellcheck.pkg.recipe.yaml
      sha256_hash: 3a774d35b6ec2946c20e2de10d37e2f8708454f4f00ec1f052e216050a07b487
    com.github.humanendpoint.sign.vsceshellcheck:
      git_hash: fae7a9cd9ad6215a08a025fbc4b53e47c5b0cbfa
      path: ~/work/munki/munki/autopkg/recipes/VSCodeExtensions/Shellcheck.sign.recipe.yaml
      sha256_hash: 42955c9eac52c51caec2443f1273bfc807ae49bd62bbaf3407f1a4bde809e37f
