<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.tilt</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Tilt</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Development</string>
			<key>description</key>
			<string>Define your dev environment as code. For microservice apps on Kubernetes.</string>
			<key>developer</key>
			<string>Tilt</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>icon_name</key>
			<string>tilt.png</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postuninstall_script</key>
			<string>#!/bin/bash
rm /usr/local/bin/tilt</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.humanendpoint.munki.tilt</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.rtrouton.SharedProcessors/PkgSigner</key>
			<dict>
				<key>git_hash</key>
				<string>56fc1ee3588f12cdd86e4e202821229873c27e21</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py</string>
				<key>sha256_hash</key>
				<string>464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.humanendpoint.download.tilt</key>
			<dict>
				<key>git_hash</key>
				<string>c554ded695469cf8e96cc88e0b4d75434e4bc9d6</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/Tilt/Tilt.download.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>c1fa6d11edb859d137a2c59c0d354cc115fa3d8145d9732ce828d2ddbdd001eb</string>
			</dict>
			<key>com.github.humanendpoint.munki.tilt</key>
			<dict>
				<key>git_hash</key>
				<string>c554ded695469cf8e96cc88e0b4d75434e4bc9d6</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/Tilt/Tilt.munki.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>a4cd7a71259d53ddc588603bfeef8318d600f6edd5fe7d781ab0110ca4544646</string>
			</dict>
			<key>com.github.humanendpoint.pkg.tilt</key>
			<dict>
				<key>git_hash</key>
				<string>c554ded695469cf8e96cc88e0b4d75434e4bc9d6</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/Tilt/Tilt.pkg.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>89823c614111ca88c4ad6e10fa314433bd0dfc9c3499131b8bd90be73d1ea9ad</string>
			</dict>
			<key>com.github.humanendpoint.sign.tilt</key>
			<dict>
				<key>git_hash</key>
				<string>c554ded695469cf8e96cc88e0b4d75434e4bc9d6</string>
				<key>path</key>
				<string>~/work/munki/munki/autopkg/recipes/Tilt/Tilt.sign.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>2b82f812fe9cede47f9f21255f8dca90d386ad0a4a64c32cd70d247aa6c1d084</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
