Identifier: local.munki.YAML
Input:
  INPUT_DESCRIPTION: Provides comprehensive YAML Language support to Visual Studio
    Code, via the yaml-language-server, with built-in Kubernetes syntax support.
  MARKETPLACE_NAME: vscode-yaml
  MUNKI_REPO_SUBDIR: apps/VSCE
  NAME: VSCE-YAML
  PUBLISHER: redhat
  pkginfo:
    catalogs:
    - testing
    category: VSCode Extensions
    description: ''
    developer: Red Hat
    display_name: YAML
    name: '%NAME%'
    unattended_install: true
ParentRecipe: com.github.humanendpoint.munki.vsceyaml
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.recipes.commonprocessors/StringReplacer:
      git_hash: a2d4f7bc18c2b403812b10846a45cfc3717a0448
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/CommonProcessors/StringReplacer.py
      sha256_hash: a57ca13c0bbf5c4f0631b44e4b29c410d1d3a9aba253b2fe38b9be7e5895a0fc
    com.github.rtrouton.SharedProcessors/PkgSigner:
      git_hash: 56fc1ee3588f12cdd86e4e202821229873c27e21
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py
      sha256_hash: 464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56
  parent_recipes:
    com.github.humanendpoint.download.vsceyaml:
      git_hash: 36ae0ffc77e7282be49a0e6893cf0a6d41b54a8b
      path: ~/work/munki/munki/autopkg/recipes/VSCodeExtensions/YAML.download.recipe.yaml
      sha256_hash: 4a7e9cd619b6417803704c4e7a9c9b0a3269bfc9b44cd2cb83ca09fa682980d4
    com.github.humanendpoint.munki.vsceyaml:
      git_hash: 36ae0ffc77e7282be49a0e6893cf0a6d41b54a8b
      path: ~/work/munki/munki/autopkg/recipes/VSCodeExtensions/YAML.munki.recipe.yaml
      sha256_hash: 22d2b5585d4e08ef1fae4ada9a8d15f25d5e054a6bdce141cdf5f5a572b36399
    com.github.humanendpoint.pkg.vsceyaml:
      git_hash: 36ae0ffc77e7282be49a0e6893cf0a6d41b54a8b
      path: ~/work/munki/munki/autopkg/recipes/VSCodeExtensions/YAML.pkg.recipe.yaml
      sha256_hash: 78f321ddf85af45eafd29539a10c8dd4ddd691275a65454285de96b6b7d9593d
    com.github.humanendpoint.sign.vsceyaml:
      git_hash: 36ae0ffc77e7282be49a0e6893cf0a6d41b54a8b
      path: ~/work/munki/munki/autopkg/recipes/VSCodeExtensions/YAML.sign.recipe.yaml
      sha256_hash: 793a4bdf875498ed521a69d0e6fdd7e8b579b2fd17d8b32298a852c85952a2da
