Identifier: local.munki.YTMusic
Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: YTMusic
  pkginfo:
    catalogs:
    - production
    category: Music
    description: A Mac app wrapper for music.youtube.com
    developer: Google Inc.
    display_name: Youtube Music
    name: '%NAME%'
    unattended_install: true
ParentRecipe: com.github.humanendpoint.munki.YouTubeMusic
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.humanendpoint.processors/URLDownloaderPython:
      git_hash: 7ab1a1e98e35585baf7e431cefb641c94d4c6732
      path: ~/work/munki/munki/autopkg/recipes/processors/URLDownloaderPython.py
      sha256_hash: 72337e153221fe1ba908684482f220ad376e59ad3b3a8f37b4bd0b7268998296
    com.github.grahampugh.recipes.commonprocessors/StringReplacer:
      git_hash: a2d4f7bc18c2b403812b10846a45cfc3717a0448
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/CommonProcessors/StringReplacer.py
      sha256_hash: a57ca13c0bbf5c4f0631b44e4b29c410d1d3a9aba253b2fe38b9be7e5895a0fc
    com.github.rtrouton.SharedProcessors/PkgSigner:
      git_hash: 56fc1ee3588f12cdd86e4e202821229873c27e21
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py
      sha256_hash: 464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56
  parent_recipes:
    com.github.humanendpoint.download.YouTubeMusic:
      git_hash: 7ab1a1e98e35585baf7e431cefb641c94d4c6732
      path: ~/work/munki/munki/autopkg/recipes/YTMusic/YouTube Music.download.recipe
      sha256_hash: d8019af7b6c7f994f972b7a615ff4eea28395cb3767a376af7f78ec7ec43dc5f
    com.github.humanendpoint.munki.YouTubeMusic:
      git_hash: 7ab1a1e98e35585baf7e431cefb641c94d4c6732
      path: ~/work/munki/munki/autopkg/recipes/YTMusic/YouTube Music.munki.recipe.yaml
      sha256_hash: 711aa26d36d77e43dd0052a89db5109f6e7bf84bdade85b32eae75d9b5b08719
    com.github.humanendpoint.pkg.YouTubeMusic:
      git_hash: 7ab1a1e98e35585baf7e431cefb641c94d4c6732
      path: ~/work/munki/munki/autopkg/recipes/YTMusic/YouTube Music.pkg.recipe
      sha256_hash: 31d3408f3090faf72fc3bd09bec11996f17b2d24c88a65a0ffd5518dc4f928c8
    com.github.humanendpoint.sign.YouTubeMusic:
      git_hash: 7ab1a1e98e35585baf7e431cefb641c94d4c6732
      path: ~/work/munki/munki/autopkg/recipes/YTMusic/Youtube Music.sign.recipe.yaml
      sha256_hash: e5f72135f9f6b4fe21286d90a72fbfa8078a08efbe51cbba5b7a547c393ffec7
